In [3]:
import numpy as np 
import pandas as pd

In [4]:
sozlukVerisi = {"istanbul": [10,12,np.nan] ,"Ankara": [20,np.nan,21],"İzmir": [12,23,13]}
havaDurumuDataFrame = pd.DataFrame(sozlukVerisi,index=["Pazartesi","Salı", "Çarşamba"])
havaDurumuDataFrame

           istanbul  Ankara  İzmir
Pazartesi      10.0    20.0     12
Salı           12.0     NaN     23
Çarşamba        NaN    21.0     13

In [5]:
havaDurumuDataFrame.reset_index()

       index  istanbul  Ankara  İzmir
0  Pazartesi      10.0    20.0     12
1       Salı      12.0     NaN     23
2   Çarşamba       NaN    21.0     13

In [6]:
havaDurumuDataFrame.dropna()

           istanbul  Ankara  İzmir
Pazartesi      10.0    20.0     12

In [7]:
havaDurumuDataFrame.dropna(axis=1)

           İzmir
Pazartesi     12
Salı          23
Çarşamba      13

In [8]:
yeniVeri = {"istanbul": [10,12,np.nan] ,"Ankara": [20,np.nan,21],"İzmir": [12,23,13],"Antalya": [np.nan,np.nan,45]}
yeniDataFrame = pd.DataFrame(yeniVeri,index=["Pazartesi","Salı", "Çarşamba"])

In [9]:
yeniDataFrame

           istanbul  Ankara  İzmir  Antalya
Pazartesi      10.0    20.0     12      NaN
Salı           12.0     NaN     23      NaN
Çarşamba        NaN    21.0     13     45.0

In [11]:
yeniDataFrame.dropna(axis=1,thresh=2)

           istanbul  Ankara  İzmir
Pazartesi      10.0    20.0     12
Salı           12.0     NaN     23
Çarşamba        NaN    21.0     13

In [12]:
yeniDataFrame

           istanbul  Ankara  İzmir  Antalya
Pazartesi      10.0    20.0     12      NaN
Salı           12.0     NaN     23      NaN
Çarşamba        NaN    21.0     13     45.0

In [13]:
yeniDataFrame.fillna(20)

           istanbul  Ankara  İzmir  Antalya
Pazartesi      10.0    20.0     12     20.0
Salı           12.0    20.0     23     20.0
Çarşamba       20.0    21.0     13     45.0

# groupby

In [14]:
maasSozlugu = {"Departman" : ["Yazılım","Yazılım","Pazarlama","Pazarlama","Hukuk","Hukuk"],
              "Calisan Ismi" : ["Ahmet","Mehmet","Atil","Burak","Zeynep","Fatma"],
               "Maas" : [100,150,200,300,400,500]
              }

In [15]:
maasDataFrame = pd.DataFrame(maasSozlugu)

In [16]:
maasDataFrame

   Departman Calisan Ismi  Maas
0    Yazılım        Ahmet   100
1    Yazılım       Mehmet   150
2  Pazarlama         Atil   200
3  Pazarlama        Burak   300
4      Hukuk       Zeynep   400
5      Hukuk        Fatma   500

In [18]:
grupObjesi = maasDataFrame.groupby("Departman")

In [19]:
grupObjesi.count()

           Calisan Ismi  Maas
Departman
Hukuk                 2     2
Pazarlama             2     2
Yazılım               2     2

In [21]:
grupObjesi.mean()

C:\Users\Lenova\AppData\Local\Temp\ipykernel_7844\104408460.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  grupObjesi.mean()

            Maas
Departman
Hukuk      450.0
Pazarlama  250.0
Yazılım    125.0

In [22]:
grupObjesi.min()

          Calisan Ismi  Maas
Departman
Hukuk            Fatma   400
Pazarlama         Atil   200
Yazılım          Ahmet   100

In [23]:
grupObjesi.max()

          Calisan Ismi  Maas
Departman
Hukuk           Zeynep   500
Pazarlama        Burak   300
Yazılım         Mehmet   150

In [24]:
grupObjesi.describe()

           Maas
          count   mean        std    min    25%    50%    75%    max
Departman
Hukuk       2.0  450.0  70.710678  400.0  425.0  450.0  475.0  500.0
Pazarlama   2.0  250.0  70.710678  200.0  225.0  250.0  275.0  300.0
Yazılım     2.0  125.0  35.355339  100.0  112.5  125.0  137.5  150.0